tests/integration/cassettes/TestInvoice.test_get.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T17:27:41",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"service_period_to\": \"2019-12-31\", \"due_date\": \"2018-10-16\", \"service_period_from\": \"2019-12-01\", \"title\": \"invoice\", \"status\": \"created\", \"items\": [{\"type\": \"title\", \"title\": \"Hours\"}, {\"type\": \"description\", \"description\": \"Listing of all hours\"}, {\"title\": \"Service\", \"net_total\": 130, \"quantity\": 2, \"type\": \"item\", \"unit_price\": 65, \"unit\": \"hours\"}], \"tax\": 8.0, \"change_address\": \"invoice\", \"customer_id\": 760748876, \"currency\": \"EUR\", \"date\": \"2018-09-17\", \"recipient_address\": \"Mein Kunde\\nHauptstrasse 1\\n8000 Z\\u00fcrich\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "534"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K6s5O8XOptnEd6RKwKXApbSKXHu2NSR2sMcVK9R/xo0/hpzsR8pK5cLNmfc88/Lm+SdYA7Jpq7qtGegUyQ8Yulzc1HxTNc2mZjAG/xU1TWWX+p6BNejIbi0GkHBdcs7LNTAwihAklFw0BW8Lscm1hN2yLnghamAQMTxZjd2IwXoDEkT5puSiPYO6bfDDfLstRFlwcU4hvyCsJwIpShEk6ICK0ACDgE8YoupBblUfkQFZ6rMu65681ThRtB0tOuqUMQFjbvABrVu9S87grbtSaaRIQcWIK3HrGs756ub3r2D1I2QDQ0CndyDh7edrYOCQOvKUZ4o1v+AMSP0A2eTTQ/AxHtGKX1QMjI3aJ0cgJ7JW8bF7rdYZtYt7wOC9pc6l4T5vZd6TDmjOir3X39CcXFAPEeSXO3awqlM0uVnygpeFaD6JjSw3ct3eAIM0mlc4Fc+cQx/vXnAWt8+RqPpEiuyEAIOt9zSlCxhYwiFLnNNalc1l3VYMaDfm7c1bPG3zyqcQc/Aw6mDHueX859+TcmRpt3csOUsHKJ+7MeQYzOBidfyCP7Pl8Mvj8OWQo4S544v58N5Gsu5h5bcr1ferx73I/6WoPirKZi3c+Dg/lH/5UZ6mw0HbUkB9+ZeCKc7PdwxGtRvQ0T5CAQfrDIbp8/lPAAAA///0OFYOXwQAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "529"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 17:27:41 GMT"
          ],
          "Etag": [
            "W/\"85f7401d9a90139d2f15e1d26b5c6013\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "fb8cb1f8-90d0-4d39-96c2-f6a073dafef1"
          ],
          "X-Runtime": [
            "1.322373"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      }
    },
    {
      "recorded_at": "2020-02-18T17:27:41",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "GET",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/894696"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K6s5O8XOptnEd6RKwKXApbSKXHu2NSR2sMcVK9R/xo0/hpzsR8pK5cLNmfc88/Lm+SdYA7Jpq7qtGegUyQ8Yulzc1HxTNc2mZjAG/xU1TWWX+p6BNejIbi0GkHBdcs7LNTAwihAklFw0BW8Lscm1hN2yLnghamAQMTxZjd2IwXoDEkT5puSiPYO6bfDDfLstRFlwcU4hvyCsJwIpShEk6ICK0ACDgE8YoupBblUfkQFZ6rMu65681ThRtB0tOuqUMQFjbvABrVu9S87grbtSaaRIQcWIK3HrGs756ub3r2D1I2QDQ0CndyDh7edrYOCQOvKUZ4o1v+AMSP0A2eTTQ/AxHtGKX1QMjI3aJ0cgJ7JW8bF7rdYZtYt7wOC9pc6l4T5vZd6TDmjOir3X39CcXFAPEeSXO3awqlM0uVnygpeFaD6JjSw3ct3eAIM0mlc4Fc+cQx/vXnAWt8+RqPpEiuyEAIOt9zSlCxhYwiFLnNNalc1l3VYMaDfm7c1bPG3zyqcQc/Aw6mDHueX859+TcmRpt3csOUsHKJ+7MeQYzOBidfyCP7Pl8Mvj8OWQo4S544v58N5Gsu5h5bcr1ferx73I/6WoPirKZi3c+Dg/lH/5UZ6mw0HbUkB9+ZeCKc7PdwxGtRvQ0T5CAQfrDIbp8/lPAAAA///0OFYOXwQAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "529"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 17:27:41 GMT"
          ],
          "Etag": [
            "W/\"85f7401d9a90139d2f15e1d26b5c6013\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "1458ff4a-c353-43a4-bd70-30a86a89d36e"
          ],
          "X-Runtime": [
            "0.268610"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/894696"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}