tests/integration/cassettes/TestInvoice.test_timesheet_no_hours.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T17:27:56",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"service_period_to\": \"2019-12-31\", \"due_date\": \"2018-10-16\", \"service_period_from\": \"2019-12-01\", \"title\": \"invoice\", \"status\": \"created\", \"items\": [{\"type\": \"title\", \"title\": \"Hours\"}, {\"type\": \"description\", \"description\": \"Listing of all hours\"}, {\"title\": \"Service\", \"net_total\": 130, \"quantity\": 2, \"type\": \"item\", \"unit_price\": 65, \"unit\": \"hours\"}], \"tax\": 8.0, \"change_address\": \"invoice\", \"customer_id\": 760748876, \"currency\": \"EUR\", \"date\": \"2018-09-17\", \"recipient_address\": \"Mein Kunde\\nHauptstrasse 1\\n8000 Z\\u00fcrich\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "534"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K6s5O8V2dzdZ35EqAZcCl9Iqcu3Z1pDYwR5XrFD/GTf+GHKyHykrlQs3Z97zzMub55/gLKhms1xvGgYmJwo9xrYU6zWvl01TrxkMMXxFQ2PZ565j4Cx6cluHERRcS865XAEDqwlBgeSiqfimEnWpZWzndcErsQYGCeOTM9gOGF2woEDIN5KLzRnUbmPop9ubSsiKi3MKhRnhciSQppxAgYmoCS0wiPiEMekO1FZ3CRmQo67ocv4pOIMjxbjBoadWWxsxlQYf0PnFu+wt3vornQdKFHVKuBC3vuGcL25+/4rOPEIxMEb0ZgcK3n6+BgYeqaVAZaa45BecAekfoJpyeoghpSO65BdLBtYlE7InUCPZ6PTYvlZrrd6lPWDx3lHrc39ftjLtyUS0Z8UumG9oTy7ohwTqyx07WNVqGt2UvOKyEs0nUStZq9XqBhjkwb7GWRfOoU/wLziz2+dI0l0mTW5EgME2BBrTBQwcYV8kTmldymZV82Llbijbm7Z42uZVyDGV4GEy0Q1Ty+nPv2ftydFu71j2jg5QObdDLDGYwNnq+AV/ZvPh4jh8PuQoYer4Yj68d4mcf1iE7UJ33eJxL/J/KZJHRcWsmRsfp4fyLz/kaToctM0FrFd/KRjj/HzHYNC7Hj3tIxSxd95iHD+f/wQAAP//6BOXj18EAAA=",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "527"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 17:27:56 GMT"
          ],
          "Etag": [
            "W/\"15276e38ab75ef0319373c60310775ea\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "20e12b3f-2166-471c-9ad1-83a916685aca"
          ],
          "X-Runtime": [
            "1.251698"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      }
    },
    {
      "recorded_at": "2020-02-18T17:27:56",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "GET",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/894698/timesheet.pdf"
      },
      "response": {
        "body": {
          "encoding": null,
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "no-cache"
          ],
          "Content-Length": [
            "0"
          ],
          "Content-Type": [
            "application/pdf"
          ],
          "Date": [
            "Tue, 18 Feb 2020 17:27:56 GMT"
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "7e958c72-bc36-4a7f-94c3-fceedbf346fc"
          ],
          "X-Runtime": [
            "0.049771"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 404,
          "message": "Not Found"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/894698/timesheet.pdf"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}