tests/integration/cassettes/TestInvoice.test_update_status.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T09:58:39",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"customer_id\": 760747823, \"title\": \"invoice\", \"service_period_from\": \"2019-12-01\", \"status\": \"created\", \"currency\": \"EUR\", \"tax\": 8.0, \"change_address\": \"invoice\", \"items\": [{\"type\": \"title\", \"title\": \"Hours\"}, {\"description\": \"Listing of all hours\", \"type\": \"description\"}, {\"unit_price\": 65, \"net_total\": 130, \"type\": \"item\", \"title\": \"Service\", \"quantity\": 2, \"unit\": \"hours\"}], \"date\": \"2018-09-17\", \"recipient_address\": \"Mein Kunde\\nHauptstrasse 1\\n8000 Z\\u00fcrich\", \"service_period_to\": \"2019-12-31\", \"due_date\": \"2018-10-16\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "534"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K9GcnWIn227iO1Il4FLgUlpFrj3bGhI72OOKFdp/xo0/hpzsR8pK5cLNmfc88/Lm+SdYA7Jp66bhDHSK5AcMXS6ur/h6tW6qmsEY/FfUNJVd6nsG1qAju7EYQMJNxTkXHBgYRQgSKi6akrelWOdawm5ZF7wUV8AgYni2GrsRg/UGJIjqTcVFewZ1m+CH+XZbiqrk4pxCfkGoJwIpShEk6ICK0ACDgM8YoupBblQfkQFZ6rMu65691ThRtB0tOuqUMQFjbvABrSveJWfwzl2rNFKkoGLEQty5hnNe3P7+Fax+gmxgCOj0FiS8/XwDDBxSR57yTFHzC86A1A+QTT49Bh/jEV3xixUDY6P2yRHIiaxVfOpeq3VGbeMeMPhgqXNpeMhbmfekA5qzYu/1NzQnF9RjBPnlnh2s6hRNbla85FUpmk+8lZeNrJtbYJBG8xqnzZxDH+9ecBa3z5Go+kSK7IQAg433NKULGFjCIUuc07qqGnFZVwxoO+btzVs8bfPapxBz8DDqYMe55fzn35NyZGm7dyw5Swcon7sx5BjM4GJ1/ILv2HJ4fRy+HHKUMHd8MR/e20jWPRZ+U6i+L572Iv+XotVRUTZr4cbH+aH8y4/qNB0O2pYCri7/UjDFeXfPYFTbAR3tIxRwsM5gmD53fwIAAP//Yze8yF8EAAA=",
          "encoding": "utf-8"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "527"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:58:39 GMT"
          ],
          "Etag": [
            "W/\"0d9ad21f5e2d19f8ab59cd65805d1d2d\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "a3deada0-7b96-4208-a161-bbee51ace0b3"
          ],
          "X-Runtime": [
            "1.181255"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices"
      }
    },
    {
      "recorded_at": "2020-02-18T09:58:39",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"status\": \"ignored\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "21"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "PUT",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893880/update_status"
      },
      "response": {
        "body": {
          "base64_string": "",
          "encoding": null
        },
        "headers": {
          "Cache-Control": [
            "no-cache"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:58:39 GMT"
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "ee0c6281-139e-4242-9a30-6010f44b40a9"
          ],
          "X-Runtime": [
            "0.056053"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 204,
          "message": "No Content"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893880/update_status"
      }
    },
    {
      "recorded_at": "2020-02-18T09:58:40",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "GET",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893880"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTwW7UMBD9ldWcnWIn227Wd6RKwKXApbSKXHt2O5C1gz2uWKH+GTd+DDnZblNWKhduzrznmZc3zz+BHOh23bStFGBz4rDD2JXi6kKulqu2bgQMMXxFy2PZ574XQA4904YwgoarWkqpJAhwhhE01FK1lVxXalVqGbt5XclKXYCAhPGBLHYDRgoONKj6TS3V+gTqNjHsptvrStWVVKcUDjNCMxLYcE6ggbY+RHQgIOIDxmR60BvTJxTAxH3RRf4hkMWRYmkg9NwZ5yKm0uADkl+8y97hjb80eeDE0aSEC3XjWynl4vr3r0j2HoqBMaK3e9Dw9vMVCPDIHQcuM1Ujz6QANj9At+W0jSGlI7qUZ0sBjpIN2TPokWxNuu9eq3XO7NMBcHhH3Pm8uytbmfZkI7qTYh/sN3TPLphtAv3ldmQbRtcZHt2sZSXrSrWf5Fqft7ppr0FAHtxrnHXhPPUJ/gVndvsUSabPbJhGBARsQuAxXSCAGHdF4pTWZd2q86YWwPuhbG/a4vM2L0OOqQQPk400TC2nP/+ejWfi/cGx7ImfoHLuhlhiMIGz1ckz+Sjmw5vj8PmQo4Sp44v58J4Sk98uwmZh+n5xfxD5vxQtj4qKWTM3Pk4P5V9+1M/T4UnbXMDF+V8Kxjg/3goYzH6Hng8Rirgj7zCOn49/AgAA//+yFSI+XwQAAA==",
          "encoding": "utf-8"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "529"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:58:40 GMT"
          ],
          "Etag": [
            "W/\"a5d2ea2099a7c6cf16e21b6e7da8610d\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "a2105d1f-8c64-4e28-97ff-d8d3343038de"
          ],
          "X-Runtime": [
            "0.291538"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893880"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}